app/Http/Controllers/api/TaskController.php

    public function index()
    {
        $tasks = Task::with('User')->get();
---
select * from `task`
select * from `users` where `users`.`id` in (12)