app/Http/Controllers/CommentsController.php

    public function store(Request $request)
    {
        $comment = new comments([
            'comment' => $request->input('comment'),
            'user_id' => auth()->user()->id,
            'task_id' => $request->input('taskid')
        ]);

        $comment->save();
---
insert into `comments` (`comment`, `user_id`, `task_id`, `updated_at`, `created_at`) values ('asdaddas', 10, '3', '2019-06-19 12:22:32', '2019-06-19 12:22:32')