app/Http/Controllers/TaskController.php

select * from `task`
select * from `users` where `users`.`id` in (12)
select * from `task` where `user_id` = 12
---
    public function index()
    {
            if(\auth()->user()->role_id == 1){
                $tasks = Task::with('User')->get();
                $AddAssigneeColumn = true;
            }else{
                $tasks = Task::with('User')->where('user_id', '=', \auth()->user()->id)->get();

select * from `roles` where `roles`.`id` in (2)
select * from `users` where `role_id` != 1
---
    public function create()
    {
        $usersList = User::where('role_id','!=', 1)->with('Role')->get();

insert into `task` (`name`, `description`, `user_id`, `updated_at`, `created_at`) values ('New Task', 'Task Management Text Area', '12', '2019-06-19 12:21:13', '2019-06-19 12:21:13')
---
    public function store(Request $request)
    {
        $userid = $request->input('selectUser');
        $task_name = $request->input('task_title');
        $task_description = $request->input('task_description');
        $task = new Task([
           'name' => $task_name,
           'description' => $task_description,
            'user_id' => $userid
        ]);

        $task->save();